Revit 2027 API
FacetingUtils.ConvertTrianglesToQuads Method
 Replaces pairs of adjacent, coplanar triangles by quadrilaterals.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<TriOrQuadFacet> ConvertTrianglesToQuads(
	TriangulationInterface triangulation
)
Public Shared Function ConvertTrianglesToQuads (
	triangulation As TriangulationInterface
) As IList(Of TriOrQuadFacet)
public:
static IList<TriOrQuadFacet^>^ ConvertTrianglesToQuads(
	TriangulationInterface^ triangulation
)
static member ConvertTrianglesToQuads :
        triangulation : TriangulationInterface -> IList<TriOrQuadFacet>
Parameters
triangulation TriangulationInterface
 A triangulated face, shell, or solid.
Return Value
IList<TriOrQuadFacet>
 A collection of triangles and quadrilaterals representing the original triangulated object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation failed.
See Also
Reference
FacetingUtils Class
Autodesk.Revit.DB Namespace